public/StkReq-In/RISIS/IMI/(20250131_104350)contohTr-nsfer.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns="urn:schemas-qad-com:xml-services"
  xmlns:qcom="urn:schemas-qad-com:xml-services:common"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soapenv:Header>
    <wsa:Action/>
    <wsa:To>urn:services-qad-com:risis</wsa:To>
    <wsa:MessageID>urn:services-qad-com::risis</wsa:MessageID>
    <wsa:ReferenceParameters>
      <qcom:suppressResponseDetail>true</qcom:suppressResponseDetail>
    </wsa:ReferenceParameters>
    <wsa:ReplyTo>
      <wsa:Address>urn:services-qad-com:</wsa:Address>
    </wsa:ReplyTo>
  </soapenv:Header>
  <soapenv:Body>
    <transferInvSingleItem>
      <qcom:dsSessionContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>domain</qcom:propertyName>
          <qcom:propertyValue>SILVADOR</qcom:propertyValue>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>scopeTransaction</qcom:propertyName>
          <qcom:propertyValue>true</qcom:propertyValue>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>version</qcom:propertyName>
          <qcom:propertyValue>ERP3_1</qcom:propertyValue>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>mnemonicsRaw</qcom:propertyName>
          <qcom:propertyValue>false</qcom:propertyValue>
        </qcom:ttContext>
        <!-- &lt;qcom:ttContext&gt; &lt;qcom:propertyQualifier&gt;QAD&lt;/qcom:propertyQualifier&gt; &lt;qcom:propertyName&gt;username&lt;/qcom:propertyName&gt; &lt;qcom:propertyValue/&gt; &lt;/qcom:ttContext&gt; &lt;qcom:ttContext&gt; &lt;qcom:propertyQualifier&gt;QAD&lt;/qcom:propertyQualifier&gt; &lt;qcom:propertyName&gt;password&lt;/qcom:propertyName&gt; &lt;qcom:propertyValue/&gt; &lt;/qcom:ttContext&gt; -->
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>action</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>entity</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>email</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>emailLevel</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
      </qcom:dsSessionContext>
      <dsItem>
        <item>
          <part>CH000028</part>
          <itemDetail>
            <lotserialQty>100</lotserialQty>
            <effDate/>
            <nbr>IT250003</nbr>
            <rmks/>
            <siteFrom>SILVADOR</siteFrom>
            <locFrom>FNG</locFrom>
            <lotserFrom/>
            <siteTo>SILVADOR</siteTo>
            <locTo>RMAT</locTo>
            <yn>true</yn>
            <yn2>true</yn2>
          </itemDetail>
        </item>
      </dsItem>
    </transferInvSingleItem>
  </soapenv:Body>
</soapenv:Envelope>
